[
  {
    "id": 1,
    "title": "Puerto Morelos Apartment 26H Selva Escondida",
    "description": "Bonito departamento en residencial privado, 2 habitaciones 1 baño.",
    "extendedDescription": "Descubre este acogedor apartamento situado en el exclusivo y tranquilo residencial Selva Escondida, un entorno diseñado para conectar con la naturaleza sin perder la comodidad. Esta propiedad es una oportunidad híbrida perfecta: ideal tanto para quienes buscan una residencia permanente relajada, como para inversores que desean generar ingresos inmediatos mediante rentas vacacionales.\n\nEl complejo garantiza tu tranquilidad con seguridad 24/7 y ofrece un estilo de vida resort gracias a sus amenidades, que incluyen una gran alberca común y una palapa ideal para disfrutar del clima caribeño. La unidad se vende semi-amueblada y en condiciones impecables, lista para habitar o rentar desde el primer día.\n\n¡No te quedes con la duda! Visita el tour virtual ahora mismo para recorrer cada rincón de esta magnífica propiedad.",
    "extendedDescription_en": "Discover this cozy apartment located in the exclusive and quiet Selva Escondida residential area, an environment designed to connect you with nature without sacrificing comfort. This property is the perfect hybrid opportunity: ideal for those seeking a relaxed permanent residence, as well as for investors looking to generate immediate income through vacation rentals.\n\nThe complex ensures your peace of mind with 24/7 security and offers a resort-style experience thanks to its amenities, including a large common pool and a palapa area perfect for enjoying the Caribbean weather. The unit is sold semi-furnished and in impeccable condition, ready to move in or rent out from day one.\n\nDon't just take our word for it! Visit the virtual tour right now to explore every corner of this magnificent property.",
    "extendedDescription_fr": "Découvrez cet appartement accueillant situé dans la résidence exclusive et paisible de Selva Escondida, un environnement conçu pour vous connecter à la nature sans sacrifier votre confort. Cette propriété est une opportunité hybride parfaite : idéale tant pour ceux qui recherchent une résidence permanente détendue que pour les investisseurs souhaitant générer des revenus immédiats grâce à la location saisonnière.\n\nLe complexe garantit votre tranquillité d'esprit avec une sécurité 24h/24 et 7j/7 et offre un style de vie 'resort' grâce à ses équipements, incluant une grande piscine commune et une palapa idéale pour profiter du climat caribéen. L'unité est vendue semi-meublée et dans un état impeccable, prête à être habitée ou louée dès le premier jour.\n\nNe manquez pas cette opportunité ! Visitez la visite virtuelle dès maintenant pour explorer chaque recoin de cette magnifique propriété.",
    "price": "$2,300,000 MXN",
    "image": "images/selva-26-h/selva26H.webp",
    "alt": "Apartment in gated community",
    "location": "Puerto Morelos",
    "type": "condo",
    "bedrooms": 2,
    "bathrooms": 1,
    "area": 65,
    "virtualTourUrl": "virtualtours/selva26-H/selva_H.html",
    "galleryPhotos": [
      "images/selva-26-h/sala.webp",
      "images/selva-26-h/cocina.webp",
      "images/selva-26-h/habitacion.webp",
      "images/selva-26-h/habitacion2.webp",
      "images/selva-26-h/baño.webp",
      "images/selva-26-h/comedor-cocina.webp"


    ],
    "features": [
    "2 Recámaras",
    "1 Baño completo",
    "65 m² de construcción",
    "3 Aires Acondicionados"
    ],
    "features_en": [
        "2 Bedrooms",
        "1 Full Bathroom",
        "65 m² construction",
        "3 Air Conditioners"
    ],
    "features_fr": [
        "2 Chambres",
        "1 Salle de bain complète",
        "65 m² de construction",
        "3 Climatiseurs"
    ],
   "amenities": [
    "Alberca común",
    "Palapa y área social",
    "Seguridad 24h",
    "Estacionamiento asignado",
    "Asadores"
    ],
    "amenities_en": [
        "Common pool",
        "Palapa and social area",
        "24/7 Security",
        "Assigned parking",
        "BBQ grills"
    ],
    "amenities_fr": [
        "Piscine commune",
        "Palapa et espace social",
        "Sécurité 24h/24",
        "Parking attribué",
        "Espace barbecue"
    ],

    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!4v1760749987641!6m8!1m7!1sBb708nUAta66jPoO4q0ZAg!2m2!1d20.87063318223515!2d-86.90575064728718!3f118.2958493157058!4f8.689329569482084!5f0.7820865974627469",
    "status": "Disponible",
    "lat":20.870525, 
    "lng":-86.904297


  },
  {
    "id": 2,
    "title": "Casa Jabin Puerto Morelos",
    "description": "Hermosa casa nueva en residencial Puntavista Puerto Morelos.",
    "extendedDescription": "Experimenta la vida de alto nivel en esta majestuosa residencia de lujo situada en el exclusivo fraccionamiento Punta Vista. Esta propiedad es una obra maestra de diseño moderno que destaca por sus acabados de alta calidad y sus amplios jardines, creando un oasis privado perfecto para el disfrute al aire libre. Es el hogar ideal para familias grandes que valoran la privacidad, el espacio y la seguridad en un entorno privilegiado.\n\nLa ubicación es inmejorable, combinando la serenidad de una zona residencial con una conectividad estratégica: a solo 10 minutos de la playa, 20 minutos del Aeropuerto Internacional y 30 minutos del vibrante centro de Cancún. Una increíble sensación de tranquilidad envuelve cada rincón de esta casa.\n\nDescubre la magnitud de esta propiedad hoy mismo. Visita el tour virtual para enamorarte de tu próximo hogar.",
    "extendedDescription_en": "Experience high-end living in this majestic luxury residence located in the exclusive Punta Vista gated community. This property is a masterpiece of modern design, distinguished by its high-quality finishes and expansive gardens, creating a perfect private oasis for outdoor enjoyment. It is the ideal home for large families who value privacy, space, and security in a privileged setting.\n\nThe location is unbeatable, combining the serenity of a residential area with strategic connectivity: just 10 minutes from the beach, 20 minutes from the International Airport, and 30 minutes from vibrant downtown Cancun. An incredible sense of tranquility surrounds every corner of this home.\n\nDiscover the magnitude of this property today. Visit the virtual tour to fall in love with your next home.",
    "extendedDescription_fr": "Faites l'expérience d'une vie haut de gamme dans cette majestueuse résidence de luxe située dans le domaine exclusif de Punta Vista. Cette propriété est un chef-d'œuvre de design moderne qui se distingue par ses finitions de haute qualité et ses vastes jardins, créant une oasis privée parfaite pour profiter du plein air. C'est la maison idéale pour les grandes familles qui apprécient l'intimité, l'espace et la sécurité dans un cadre privilégié.\n\nL'emplacement est imbattable, alliant la sérénité d'un quartier résidentiel à une connectivité stratégique : à seulement 10 minutes de la plage, 20 minutes de l'aéroport international et 30 minutes du centre vibrant de Cancún. Une incroyable sensation de tranquillité enveloppe chaque recoin de cette maison.\n\nDécouvrez l'ampleur de cette propriété dès aujourd'hui. Visitez la visite virtuelle pour tomber amoureux de votre prochaine demeure.",
    "price": "$6,400,000 MXN",
    "image": "images/puntavista/fachada.webp",
    "alt": "Gate community house puerto morelos Puntavista",
    "location": "Puerto Morelos",
    "type": "house",
    "bedrooms": 3,
    "bathrooms": 3.5,
    "area": 210,
    "virtualTourUrl": "virtualtours/puntavista/puntavista.html",
    "galleryPhotos": [
      "images/puntavista/fachada.webp",
      "images/puntavista/sala.webp",
      "images/puntavista/cocina.webp",
      "images/puntavista/habitacion2.webp",
      "images/puntavista/baño.webp",
      "images/puntavista/alberca.webp"
    ],
    "features": [
    "3 Recámaras (principal con vestidor)",
    "3 y medio Baños",
    "210 m² de construcción",
    "170 m² de terreno",
    "4 Aires Acondicionados",
    "Se entrega amueblada y equipada"
    ],
    "features_en": [
        "3 Bedrooms (master with walk-in closet)",
        "3.5 Bathrooms",
        "210 m² construction",
        "170 m² lot",
        "4 Air Conditioners",
        "Furnished and equipped"
    ],
    "features_fr": [
        "3 Chambres (principale avec dressing)",
        "3,5 Salles de bain",
        "210 m² de construction",
        "Terrain de 170 m²",
        "4 Climatiseurs",
        "Meublée et équipée"
    ],
    "amenities": [
      "Seguridad 24h",
      "Palapa",
      "Alberca"
    ],
    "amenities_en": [
          "24/7 Security",
          "Palapa",
          "Pool"
        ],
    "amenities_fr": [
          "Sécurité 24h/24",
          "Palapa",
          "Piscine"
        ],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!4v1760750648307!6m8!1m7!1sl1wkU47Q_4zgd8FN7QjADQ!2m2!1d20.87425405153533!2d-86.89008811513162!3f70.47935738288757!4f-12.262008620005489!5f0.7820865974627469",
    "status": "Disponible",
    "lat":20.874705,
    "lng": -86.888049
  },
  {
    "id": 3,
    "title": "Casa Residencial El Faro Puerto Morelos",
    "description": "Bonita casa 2 habitaciones 1 baño.",
    "extendedDescription": "Descubre esta casa en venta en el codiciado Residencial El Faro, en el corazón de Puerto Morelos. Esta propiedad representa un lienzo en blanco: es la oportunidad perfecta para remodelar, personalizar y plasmar tu propio estilo en cada rincón. Su ubicación dentro del residencial es estratégica e inmejorable, situada a pocos pasos de la alberca común y con acceso rápido a la salida principal. Ya sea que busques crear tu hogar soñado o generar ingresos a través de rentas en un destino de alta demanda, esta es una inversión inteligente con gran potencial de plusvalía.\n\n¡Visualiza las posibilidades! Visita el tour virtual para conocer más de ella.",
    "extendedDescription_en": "Discover this house for sale in the sought-after El Faro Residential area in Puerto Morelos. This unit is a hidden gem waiting for your touch: perfect for remodeling, customizing, and infusing with your unique style. Its location within the complex is unbeatable, conveniently positioned near the pool and the main exit. Whether you plan to live here or rent it out, this is an excellent investment opportunity with high appreciation potential in a growing market.\n\nVisualize the possibilities! Visit the virtual tour to learn more about this property.",
    "extendedDescription_fr": "Découvrez cette maison à vendre dans le quartier prisé de Residencial El Faro à Puerto Morelos. Cette unité est une toile vierge idéale pour rénover, personnaliser et lui donner votre propre style. Son emplacement au sein de la résidence est imbattable, stratégiquement situé près de la piscine et de la sortie principale. Que vous souhaitiez y habiter ou la louer, c'est une excellente opportunité d'investissement avec un fort potentiel de plus-value.\n\nVisualisez les possibilités ! Visitez la visite virtuelle pour en savoir plus sur cette propriété.",
    "price": "$2,150,000 MXN",
    "image": "images/maracaibo-7/fachada.webp",
    "alt": "Charming house with patio puerto morelos El Faro",
    "location": "Puerto Morelos",
    "type": "house",
    "bedrooms": 2,
    "bathrooms": 1,
    "area": 65,
    "virtualTourUrl": "virtualtours/Maracaibo-7/maracaibo.html",
    "galleryPhotos": [
      "images/maracaibo-7/fachada.webp",
      "images/maracaibo-7/sala.webp",
      "images/maracaibo-7/sala-comedor.webp",
      "images/maracaibo-7/habitacion1.webp",
      "images/maracaibo-7/habitacion.webp",
      "images/maracaibo-7/detalle.webp",
      "images/maracaibo-7/adorno.webp"
    ],
    "features": [
    "2 Recámaras",
    "1 Baño",
    "65 m² de construcción",
    "Amueblada"
    ],
    "features_en": [
        "2 Bedrooms",
        "1 Bathroom",
        "65 m² construction",
        "Furnished"
    ],
    "features_fr": [
        "2 Chambres",
        "1 Salle de bain",
        "65 m² de construction",
        "Meublée"
    ],
    "amenities": [
        "Alberca común",
        "Seguridad 24h",
        "Cercanía a la entrada"
    ],
    "amenities_en": [
        "Common pool",
        "24/7 Security",
        "Close to entrance"
    ],
    "amenities_fr": [
        "Piscine commune",
        "Sécurité 24h/24",
        "Proche de l'entrée"
    ],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!4v1760752238359!6m8!1m7!1scgtdBYeYDm4ejxgrbJ5tTA!2m2!1d20.87198891776686!2d-86.90112488175393!3f3.074719195244711!4f2.8572826360244363!5f0.7820865974627469",
     "status": "reservada",
     "lat":20.873389, 
     "lng": -86.900048

  },
  {
    "id": 4,
    "title": "Terrenos en venta en Regatta Puerto Morelos",
    "description": "2 terrenos juntos en venta en Puerto Morelos .",
    "extendedDescription": "Oportunidad única para desarrolladores o familias: 2 Terrenos exclusivos con uso de suelo unifamiliar disponibles en venta. Estas parcelas se encuentran en el corazón de Residencial Regatta, un desarrollo galardonado y reconocido por su firme enfoque ecológico y sustentable. Vivir aquí significa rodearse de naturaleza, parques y un diseño urbano que respeta el medio ambiente.\n\nAmbos terrenos están listos para escriturar y construir. Son el lienzo perfecto para diseñar y edificar la casa de tus sueños en una comunidad segura y de alta plusvalía. Aprovecha esta oportunidad para invertir en una de las zonas con mayor crecimiento y calidad de vida.",
    "extendedDescription_en": "Unique opportunity for developers or families: 2 Exclusive lots with single-family land use available for sale. These parcels are located in the heart of Residencial Regatta, a development renowned for its strong ecological and sustainable focus. Living here means surrounding yourself with nature, parks, and urban design that respects the environment.\n\nBoth lots are ready for title transfer and construction. They are the perfect canvas to design and build the home of your dreams in a secure community with high appreciation value. Seize this opportunity to invest in an area offering exceptional quality of life.",
    "extendedDescription_fr": "Opportunité unique pour les promoteurs ou les familles : 2 Terrains exclusifs à usage résidentiel unifamilial disponibles à la vente. Ces parcelles sont situées au cœur du Residencial Regatta, un développement reconnu pour sa forte approche écologique et durable. Vivre ici, c'est s'entourer de nature, de parcs et d'un design urbain respectueux de l'environnement.\n\nLes deux terrains sont prêts pour le transfert de titre et la construction. Ils constituent la toile de fond parfaite pour concevoir et bâtir la maison de vos rêves dans une communauté sécurisée à forte plus-value. Saisissez cette opportunité d'investir dans une zone offrant une qualité de vie exceptionnelle.",    
    "price": "$1,800,000 MXN",
    "image": "images/regatta/amenidades.webp",
    "alt": "Eco lot at Regatta gate community mangrove view puerto morelos",
    "location": "Puerto Morelos",
    "type": "land",
    "bedrooms": 0,
    "bathrooms": 0,
    "area": 320,
    "virtualTourUrl": "",
    "galleryPhotos": [
      "images/regatta/aerea.webp",
      "images/regatta/aerea-2.webp",
      "images/regatta/aerea-1.webp",
      "images/regatta/alberca.webp",
      "images/regatta/entrada.webp"
    ],
    "features": [
    "Terreno unifamiliar",
    "160 m² cada uno",
    "Libre de gravamen"
    ],
    "features_en": [
        "Single-family lot",
        "160 m² each",
        "Clean title / Debt-free"
    ],
    "features_fr": [
        "Terrain unifamilial",
        "160 m² chacun",
        "Titre clair / Libre de privilège"
    ],
    "amenities": [
        "Alberca familiar",
        "Áreas verdes protegidas",
        "Seguridad y acceso controlado",
        "Parque de Yoga",
        "Área de Picnic",
        "Instalaciones subterráneas"
    ],
    "amenities_en": [
        "Family pool",
        "Protected green areas",
        "Security & Controlled access",
        "Yoga Park",
        "Picnic area",
        "Underground utilities"
    ],
    "amenities_fr": [
        "Piscine familiale",
        "Espaces verts protégés",
        "Sécurité et accès contrôlé",
        "Parc de Yoga",
        "Espace pique-nique",
        "Installations souterraines"
],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d3134.7249163431684!2d-86.88802479761543!3d20.878612213486928!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e0!3m2!1ses-419!2smx!4v1760809591391!5m2!1ses-419!2smx",
    "status": "Disponible",
    "lat":20.876619, 
    "lng":-86.887600
    
  },
  {
    "id": 5,
    "title": "Eco lote en Venta Puntavista Puerto Morelos",
    "description": "Eco lotes con vista al manglar.",
    "extendedDescription": "Aprovecha esta oportunidad de inversión en una privada exclusiva dentro del prestigioso desarrollo Punta Vista. Este lote es el escenario perfecto para diseñar y construir una residencia de dos niveles hecha a tu medida. Disfruta de todos los beneficios de vivir en un residencial de lujo: infraestructura moderna, entorno seguro y una comunidad tranquila, todo adquirido a un precio de oportunidad. No dejes pasar la chance de construir tu patrimonio en una zona de alta plusvalía.",
    "extendedDescription_en": "Seize this investment opportunity in an exclusive private cluster within the prestigious Punta Vista development. This lot is the perfect setting to design and build a custom two-story residence. Enjoy all the benefits of living in a luxury residential area: modern infrastructure, a secure environment, and a quiet community, all available at an opportunity price. Don't miss the chance to build your legacy in an area with high appreciation value.",
    "extendedDescription_fr": "Saisissez cette opportunité d'investissement dans un secteur privé exclusif au sein du prestigieux développement Punta Vista. Ce terrain est le cadre idéal pour concevoir et construire une résidence sur deux niveaux sur mesure. Profitez de tous les avantages d'une vie résidentielle de luxe : infrastructures modernes, environnement sécurisé et communauté paisible, le tout à un prix d'opportunité. Ne manquez pas l'occasion de bâtir votre patrimoine dans une zone à forte plus-value.",    
    "price": "$1,450,000 MXN",
    "image": "images/lotes-puntavista/alberca.webp",
    "alt": "Eco lot in Puntavista gate community mangroove view",
    "location": "Puerto Morelos",
    "type": "land",
    "bedrooms": 0,
    "bathrooms": 0,
    "area": 160,
    "virtualTourUrl": "",
    "galleryPhotos": [
      "images/lotes-puntavista/aerea-1.webp",
      "images/lotes-puntavista/aerea-2.webp",
      "images/lotes-puntavista/frontal.webp",
      "images/lotes-puntavista/alberca.webp"
    ],
    
    "features": [
      "Terreno en privada",
      "160 m²",
      "Uso de suelo residencial"
    ],
    "features_en": [
    "Lot in gated cluster",
    "160 m²",
    "Residential land use"
],
"features_fr": [
    "Terrain en secteur privé",
    "160 m²",
    "Usage résidentiel"
],
"amenities": [
    "Palapa",
    "Alberca",
    "Vigilancia 24/7",
    "Servicios subterráneos",
    "Calles pavimentadas"
],
"amenities_en": [
    "Palapa",
    "Pool",
    "24/7 Surveillance",
    "Underground utilities",
    "Paved streets"
],
"amenities_fr": [
    "Palapa",
    "Piscine",
    "Surveillance 24h/24",
    "Services souterrains",
    "Rues pavées"
],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3134.820253575808!2d-86.88905414385414!3d20.874043327098708!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x8f4c2be0fd97f931%3A0x63caff9188902318!2sResidencial%20Puntavista!5e0!3m2!1ses-419!2smx!4v1760809705620!5m2!1ses-419!2smx",
    "status": "Disponible",
    "lat":20.873692,
    "lng": -86.887743
  },
  {
    "id": 6,
    "title": "Departamento Naay Selva Escondida 34B Puerto Morelos",
    "description": "Departamento en Venta Selva Escondida Naay planta baja.",
    "extendedDescription": "Tu refugio perfecto en la Riviera Maya te espera en el edificio Naay de Selva Escondida. Este increíble departamento de 2 habitaciones y 2 baños completos se entrega totalmente amueblado y listo para habitar (llave en mano). Su ubicación estratégica combina lo mejor de dos mundos: la cercanía a solo 10 minutos de las playas de Puerto Morelos y la conectividad a 30 minutos del Aeropuerto Internacional de Cancún.\n\nAquí encontrarás un verdadero oasis de silencio y tranquilidad, rodeado de naturaleza. Es el espacio seguro y relajante ideal para descansar y recargar energías después de un día de tours y aventuras por el Caribe.",
    "extendedDescription_en": "Your perfect retreat in the Riviera Maya awaits in the Naay building at Selva Escondida. This incredible 2-bedroom, 2-full bathroom apartment comes fully furnished and move-in ready (turnkey). Its strategic location offers the best of both worlds: proximity just 10 minutes from the beaches of Puerto Morelos and connectivity 30 minutes from Cancun International Airport.\n\nHere you will find a true oasis of silence and tranquility, surrounded by nature. It is the ideal safe and relaxing space to rest and recharge after a day of tours and adventures in the Caribbean.",
    "extendedDescription_fr": "Votre refuge parfait sur la Riviera Maya vous attend dans l'immeuble Naay de Selva Escondida. Cet incroyable appartement de 2 chambres et 2 salles de bain complètes est livré entièrement meublé et prêt à vivre (clé en main). Son emplacement stratégique offre le meilleur des deux mondes : la proximité à seulement 10 minutes des plages de Puerto Morelos et la connectivité à 30 minutes de l'aéroport international de Cancún.\n\nVous trouverez ici une véritable oasis de silence et de tranquillité, entourée par la nature. C'est l'espace sûr et relaxant idéal pour se reposer et se ressourcer après une journée d'excursions et d'aventures dans les Caraïbes.",   
    "price": "$2,500,000 MXN",
    "image": "images/naay/fachada-naay.webp",
    "alt": "Naay Selva escondida",
    "location": "Puerto Morelos",
    "type": "condo",
    "bedrooms": 2,
    "bathrooms": 2,
    "area": 70,
    "virtualTourUrl": "virtualtours/naay-34-B/naay.html",
    "galleryPhotos": [
      "images/naay/sala-naay.webp",
      "images/naay/cocina-naay.webp",
      "images/naay/sala2-naay.webp",
      "images/naay/baño-naay.webp",
      "images/naay/habitacion-naay.webp",
      "images/naay/barra-naay.webp"
    ],
    "features": [
      "2 Recámaras",
      "2 Baños completos",
      "70 m² de construcción",
      "Aires Acondicionados"
    ],
    "features_en": [
    "2 Bedrooms",
    "2 Full Bathrooms",
    "70 m² construction",
    "Air Conditioners"
    ],
    "features_fr": [
        "2 Chambres",
        "2 Salles de bain complètes",
        "70 m² de construction",
        "Climatiseurs"
    ],
    "amenities": [
        "Alberca común",
        "Seguridad 24h",
        "Gimnasio",
        "Estacionamiento asignado",
        "Area de asador"
    ],
    "amenities_en": [
        "Common pool",
        "24/7 Security",
        "Gym",
        "Assigned parking",
        "BBQ area"
    ],
    "amenities_fr": [
        "Piscine commune",
        "Sécurité 24h/24",
        "Salle de sport",
        "Parking attribué",
        "Espace barbecue"
],
    
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!4v1760742673574!6m8!1m7!1szicz57swGACyTP-3XLE5aw!2m2!1d20.87040780617195!2d-86.9059090304031!3f178.07151176737258!4f-15.077935848906023!5f0.7820865974627469",
    "status": "Disponible",
    "lat":20.870447, 
    "lng": -86.905818
  },

  {
    "id": 7,
    "title": "Departamento en Renta y en Venta Selva Escondida",
    "description": "Bonito departamento en residencial privado, 2 habitaciones 1 baño.",
    "extendedDescription": "Oportunidad excepcional con doble potencial: Disponible tanto para RENTA como para VENTA. Este hermoso departamento se ubica en el exclusivo entorno de Selva Escondida, Puerto Morelos. Diseñado para el confort, cuenta con 2 habitaciones, 1 baño completo, una cocina integral totalmente equipada y una sala acogedora ideal para la convivencia.\n\nVivir aquí es disfrutar de tranquilidad total gracias a la seguridad 24 horas, rodeado de exuberantes áreas verdes y amenidades pensadas para el disfrute de toda la familia. Una opción perfecta ya sea para establecer tu hogar o como inversión inmediata.",
    "extendedDescription_en": "Exceptional opportunity with dual potential: Available for both RENT and SALE. This beautiful apartment is located in the exclusive setting of Selva Escondida, Puerto Morelos. Designed for comfort, it features 2 bedrooms, 1 full bathroom, a fully equipped kitchen, and a cozy living room perfect for gathering.\n\nLiving here means enjoying total peace of mind with 24/7 security, surrounded by lush green areas and amenities designed for the whole family to enjoy. A perfect option whether establishing your home or seeking an immediate investment.",
    "extendedDescription_fr": "Opportunité exceptionnelle à double potentiel : Disponible à la fois à la LOCATION et à la VENTE. Ce bel appartement est situé dans le cadre exclusif de Selva Escondida, à Puerto Morelos. Conçu pour le confort, il dispose de 2 chambres, 1 salle de bain complète, une cuisine entièrement équipée et un salon accueillant idéal pour la convivialité.\n\nVivre ici, c'est profiter d'une tranquillité totale grâce à une sécurité 24h/24, entouré d'espaces verts luxuriants et d'équipements conçus pour toute la famille. Une option parfaite, que ce soit pour y établir votre foyer ou comme investissement immédiat.",
    "price": "$2,400,000 MXN/15,900 MXN mes",
    "image": "images/selva-16-g/16-g.webp",
    "alt": "Departamento en Selva escondida",
    "location": "Puerto Morelos",
    "type": "condo",
    "bedrooms": 2,
    "bathrooms": 1,
    "area": 65,
    "virtualTourUrl": "virtualtours/selva-16g/selva-16g.html",
    "galleryPhotos": [
      "images/selva-16-g/sala.webp",
      "images/selva-16-g/cocina.webp",
      "images/selva-16-g/comedor.webp",
      "images/selva-16-g/habitacion.webp",
      "images/selva-16-g/habitacion-1.webp",
      "images/selva-16-g/baño.webp"
    ],
    "features": [
    "2 Recámaras",
    "1 Baño completo",
    "65 m² de construcción",
    "Aires Acondicionados",
    "Cocina equipada"
  ],
  "features_en": [
      "2 Bedrooms",
      "1 Full Bathroom",
      "65 m² construction",
      "Air Conditioners",
      "Equipped kitchen"
  ],
  "features_fr": [
      "2 Chambres",
      "1 Salle de bain complète",
      "65 m² de construction",
      "Climatiseurs",
      "Cuisine équipée"
  ],
  "amenities": [
      "Seguridad 24h",
      "Áreas verdes",
      "Cercanía a la playa"
  ],
  "amenities_en": [
      "24/7 Security",
      "Green areas",
      "Close to beach"
  ],
  "amenities_fr": [
      "Sécurité 24h/24",
      "Espaces verts",
      "Proche de la plage"
],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!4v1760749987641!6m8!1m7!1sBb708nUAta66jPoO4q0ZAg!2m2!1d20.87063318223515!2d-86.90575064728718!3f118.2958493157058!4f8.689329569482084!5f0.7820865974627469",
    "status": "Disponible",
    "lat":20.869727,
    "lng": -86.904093
  },

  {
    "id": 8,
    "title": "Casa en Venta en Residencial Aldea Umm",
    "description": "Casa en venta en residencial privado Aldea Umm.",
    "extendedDescription": "Vive la exclusividad en esta espectacular casa en venta situada en el prestigioso residencial Aldea Umm, en Puerto Morelos. Con un diseño generoso y funcional, esta propiedad ofrece 4 espaciosas habitaciones y 4 baños completos, garantizando total privacidad y confort para cada miembro de la familia o invitados. La cocina equipada es el corazón del hogar, mientras que su alberca privada se convierte en el santuario perfecto para relajarse bajo el sol del Caribe.\n\nAldea Umm se distingue por integrar la modernidad con la naturaleza, ofreciendo seguridad 24 horas, hermosas áreas verdes y amenidades de primer nivel para disfrutar en familia.",
    "extendedDescription_en": "Experience exclusivity in this spectacular house for sale located in the prestigious Aldea Umm residential area in Puerto Morelos. With a generous and functional design, this property offers 4 spacious bedrooms and 4 full bathrooms, ensuring total privacy and comfort for every family member or guest. The equipped kitchen is the heart of the home, while its private pool becomes the perfect sanctuary to relax under the Caribbean sun.\n\nAldea Umm is distinguished by integrating modernity with nature, offering 24/7 security, beautiful green areas, and top-tier amenities for family enjoyment.",
    "extendedDescription_fr": "Vivez l'exclusivité dans cette spectaculaire maison à vendre située dans le prestigieux quartier résidentiel d'Aldea Umm, à Puerto Morelos. Avec un design généreux et fonctionnel, cette propriété offre 4 chambres spacieuses et 4 salles de bain complètes, garantissant une intimité et un confort total pour chaque membre de la famille ou les invités. La cuisine équipée est le cœur de la maison, tandis que sa piscine privée devient le sanctuaire idéal pour se détendre sous le soleil des Caraïbes.\n\nAldea Umm se distingue par l'intégration de la modernité à la nature, offrant une sécurité 24h/24, de beaux espaces verts et des équipements de premier ordre pour le plaisir de la famille.",
    "price": "$6,250,000 MXN",
    "image": "images/aldea-umm/fachada.webp",
    "alt": "Casa en Aldea Umm Puerto Morelos",
    "location": "Puerto Morelos",
    "type": "house",
    "bedrooms": 4,
    "bathrooms": 4,
    "area": 200,
    "virtualTourUrl": "virtualtours/aldea-umm/aldea-umm.html",
    "galleryPhotos": [
      "images/aldea-umm/sala.webp",
      "images/aldea-umm/cocina.webp",
      "images/aldea-umm/habitacion.webp",
      "images/aldea-umm/baño.webp",
      "images/aldea-umm/alberca.webp",
      "images/aldea-umm/comedor.webp",
      "images/aldea-umm/habitacion-master.webp",
      "images/aldea-umm/sala-tv.webp",
      "images/aldea-umm/baño-master.webp"
    ],
    
    "features": [
    "4 Recámaras",
    "4 Baños completos",
    "200 m² de construcción",
    "160 m² de terreno",
    "Aires Acondicionados"
    ],
    "features_en": [
        "4 Bedrooms",
        "4 Full Bathrooms",
        "200 m² construction",
        "160 m² lot",
        "Air Conditioners"
    ],
    "features_fr": [
        "4 Chambres",
        "4 Salles de bain complètes",
        "200 m² de construction",
        "Terrain de 160 m²",
        "Climatiseurs"
    ],
    "amenities": [
        "Seguridad 24h",
        "Áreas verdes",
        "Alberca privada"
    ],
    "amenities_en": [
        "24/7 Security",
        "Green areas",
        "Private pool"
    ],
    "amenities_fr": [
        "Sécurité 24h/24",
        "Espaces verts",
        "Piscine privée"
    ],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d1317.8364416635986!2d-86.88170802101804!3d20.89604615661797!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e0!3m2!1ses!2smx!4v1763233339251!5m2!1ses!2smx",
    "status": "Disponible",
    "lat":20.896021,
    "lng": -86.879465

  
  },

{
    "id": 9,
    "title": "Departamento en Venta en Caleta Yal-Kú Akumal",
    "description": "Departamento en venta en pivada exclusiva en caleta Yal-Kú en Akumal Quintana Roo.",
    "extendedDescription": "Sumérgete en la magia de Akumal con este increíble departamento situado en la privilegiada zona de Yal-Ku. Esta unidad de 2 habitaciones y 2 baños completos se entrega totalmente amueblada y equipada, lista para habitar o para comenzar a generar ingresos inmediatos en plataformas como Airbnb. Su ubicación es estratégica: a solo 5 minutos de la playa y de la famosa caleta, pero con la privacidad suficiente para garantizar silencio total.\n\nLa propiedad colinda con la zona de selva, ofreciendo un contacto directo con la naturaleza y vistas relajantes. Es un espacio seguro y sereno, diseñado para ser tu santuario de descanso después de explorar las maravillas del Caribe Mexicano.",
    "extendedDescription_en": "Immerse yourself in the magic of Akumal with this incredible apartment located in the privileged Yal-Ku area. This 2-bedroom, 2-full bathroom unit comes fully furnished and equipped, ready to move in or to start generating immediate income on platforms like Airbnb. Its location is strategic: just 5 minutes from the beach and the famous lagoon, yet private enough to guarantee total silence.\n\nThe property borders the jungle zone, offering direct contact with nature and relaxing views. It is a safe and serene space, designed to be your sanctuary of rest after exploring the wonders of the Mexican Caribbean.",
    "extendedDescription_fr": "Plongez dans la magie d'Akumal avec cet incroyable appartement situé dans la zone privilégiée de Yal-Ku. Cette unité de 2 chambres et 2 salles de bain complètes est livrée entièrement meublée et équipée, prête à être habitée ou à générer des revenus immédiats sur des plateformes comme Airbnb. Son emplacement est stratégique : à seulement 5 minutes de la plage et de la célèbre lagune, mais suffisamment privé pour garantir un silence total.\n\nLa propriété borde la zone de jungle, offrant un contact direct avec la nature et des vues relaxantes. C'est un espace sûr et serein, conçu pour être votre sanctuaire de repos après avoir exploré les merveilles des Caraïbes mexicaines.",
    "price": "$300,000 USD",
    "image": "images/yal-ku/caleta.webp",
    "alt": "Departamento Akumal Yal-Ku caleta Yal-ku",
    "location": "Akumal",
    "type": "condo",
    "bedrooms": 2,
    "bathrooms": 2,
    "area": 381,
    "virtualTourUrl": "virtualtours/yal-ku/yalku.html",
    "galleryPhotos": [
      "images/yal-ku/entrada.webp",
      "images/yal-ku/sala.webp",
      "images/yal-ku/comedor.webp",
      "images/yal-ku/cocina.webp",
      "images/yal-ku/habitacion.webp",
      "images/yal-ku/baño.webp",
      "images/yal-ku/habitacion-2.webp",
      "images/yal-ku/alberca.webp",
      "images/yal-ku/caleta.webp",
      "images/yal-ku/caleta-2.webp"
    ],
    "features": [
    "2 Recámaras",
    "2 Baños completos",
    "99.95 m² de construcción",
    "Aires Acondicionados",
    "381 m² de terreno",
    "Planta baja"
    ],
    "features_en": [
        "2 Bedrooms",
        "2 Full Bathrooms",
        "99.95 m² construction",
        "Air Conditioners",
        "381 m² lot",
        "Ground floor unit"
    ],
    "features_fr": [
        "2 Chambres",
        "2 Salles de bain complètes",
        "99,95 m² de construction",
        "Climatiseurs",
        "Terrain de 381 m²",
        "Rez-de-chaussée"
    ],
    "amenities": [
        "Alberca común",
        "Seguridad 24h",
        "Gimnasio",
        "Estacionamiento asignado",
        "Área de asador"
    ],
    "amenities_en": [
        "Common pool",
        "24/7 Security",
        "Gym",
        "Assigned parking",
        "BBQ area"
    ],
    "amenities_fr": [
        "Piscine commune",
        "Sécurité 24h/24",
        "Salle de sport",
        "Parking attribué",
        "Espace barbecue"
    ],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d5288.141387410195!2d-87.30780572066075!3d20.411635795928458!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e0!3m2!1ses!2smx!4v1763830371016!5m2!1ses!2smx",
    "status": "Disponible",
    "lat":20.411941,
    "lng": -87.309404
},
{
    "id": 10,
    "title": "Casa en Venta Xcaret Playa del Carmen",
    "description": "Increible casa en venta en la exclusiva area de los parques de  Xcaret Playa del Carmen.",
    "description_en": "Incredible house for sale in the exclusive area of the Xcaret parks in Playa del Carmen.",
    "extendedDescription": "Imagina vivir o vacacionar inmerso en la magia de la Riviera Maya. Esta casa en venta cuenta con una ubicación estratégica en Paseo de los Sentidos, la ruta directa hacia los parques Xenses y Xcaret. Disfruta de un entorno rodeado de selva y seguridad 24 horas, pero con un beneficio exclusivo que hace esta oferta irresistible: **Te incluimos 2 años de Membresía Xcaret**, garantizándote acceso diario e ilimitado al parque.\n\nEs una propiedad con doble propósito: un santuario vacacional de ensueño para tu familia y una máquina de generar ingresos como renta vacacional, aprovechando el flujo constante de turistas que visitan los parques más famosos de México.",
    "extendedDescription_en": "Imagine living or vacationing immersed in the magic of the Riviera Maya. This house for sale boasts a strategic location on Paseo de los Sentidos, the direct route to the Xenses and Xcaret parks. Enjoy an environment surrounded by jungle and 24-hour security, but with an exclusive benefit that makes this offer irresistible: **We include a 2-year Xcaret Membership**, guaranteeing you unlimited daily access to the park.\n\nThis is a dual-purpose property: a dream vacation sanctuary for your family and an income-generating machine for vacation rentals, capitalizing on the constant flow of tourists visiting Mexico's most famous parks.",
    "extendedDescription_fr": "Imaginez vivre ou passer des vacances immergé dans la magie de la Riviera Maya. Cette maison à vendre bénéficie d'un emplacement stratégique sur le Paseo de los Sentidos, la route directe vers les parcs Xenses et Xcaret. Profitez d'un environnement entouré de jungle et d'une sécurité 24h/24, mais avec un avantage exclusif qui rend cette offre irrésistible : **Nous incluons 2 ans d'adhésion à Xcaret**, vous garantissant un accès quotidien et illimité au parc.\n\nC'est une propriété à double usage : un sanctuaire de vacances de rêve pour votre famille et une machine à générer des revenus en location saisonnière, capitalisant sur le flux constant de touristes visitant les parcs les plus célèbres du Mexique.",
     "price": "$880,000. USD",
    "image": "images/piedra/fachada.webp",
    "alt": "Terreno en Aldea Umm Puerto Morelos",
    "location": "Playa del Carmen",
    "type": "house",
    "bedrooms":4,
    "bathrooms":4,
    "area":391,
    "youtubeUrl":"",
    "virtualTourUrl": "virtualtours/piedra/casa-piedra.html",

  
    "galleryPhotos": [
      "images/piedra/fachada.webp",
      "images/piedra/sala.webp",
      "images/piedra/comedor.webp",
      "images/piedra/alberca.webp",
      "images/piedra/habitacion.webp",
      "images/piedra/master.webp",
      "images/piedra/balcon.webp",
      "images/piedra/sala-tv.webp"
    ],
    
   "features": [
    "661 m² de terreno",
    "Uso de suelo residencial",
    "391 m² de construcción",
    "Alberca",
    "Jardin privado"
    ],
    "features_en": [
        "661 m² lot",
        "Residential land use",
        "391 m² construction",
        "Pool",
        "Private garden"
    ],
    "features_fr": [
        "Terrain de 661 m²",
        "Usage résidentiel",
        "391 m² de construction",
        "Piscine",
        "Jardin privé"
    ],
    "amenities": [
        "Seguridad 24h",
        "Acceso directo a los parques Xcaret"
    ],
    "amenities_en": [
        "24/7 Security",
        "Direct access to Xcaret parks"
    ],
    "amenities_fr": [
        "Sécurité 24h/24",
        "Accès direct aux parcs Xcaret"
    ],
   
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d233.43572281161303!2d-87.12929633600481!3d20.589218800174407!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e0!3m2!1ses!2smx!4v1764105319623!5m2!1ses!2smx",
    "status": "Disponible",
    "lat":20.589165, 
    "lng":-87.129241
},
{
    "id": 11,
    "title": "Casa en Venta Puntarena Puerto Morelos",
    "description": "Hermosa casa en venta en residencial privado Puntarena Puerto Morelos.",
    "extendedDescription": "Para muchos compradores de EE. UU. y Canadá, el sueño de tener una casa en el Caribe a menudo se ve empañado por la pesadilla logística de construir desde cero. Los tiempos de ejecución de obra inciertos, la gestión de contratistas a distancia, la fluctuación en la calidad de los materiales y las barreras del idioma pueden convertir un proyecto emocionante en años de estrés y sobrecostos. La incertidumbre de no saber cuándo (o cómo) se terminará tu hogar es un riesgo que no necesitas correr.\n\nEsta residencia en Puntarena elimina por completo esa incertidumbre, ofreciéndote una solución inmediata en una ubicación privilegiada con vistas al manglar. Al adquirir esta propiedad terminada, obtienes la seguridad de un hogar funcional a pasos de la playa y supermercados. Es el equilibrio perfecto entre la privacidad de la naturaleza y la comodidad de tener todo a tu alcance.\n\nPor una inversión de $11,200,000 MXN, recibes una propiedad totalmente equipada:\n\nCaracterísticas de la Residencia:\n- 6 Amplias habitaciones\n- 5.5 Baños completos\n- Alberca privada\n- Área flexible (Yoga, Cine o Juegos)\n- 7 Aires acondicionados instalados\n- Ventanas anticiclónicas\n\nCocina Gourmet \"Llave en Mano\":\n- Refrigerador de doble puerta\n- Horno eléctrico y parrilla con campana\n- Lavavajillas (Dishwasher)\n- Barra de granito\n- Despachador de agua\n- Utensilios de cocina completos\n\nNo pierdas años construyendo cuando puedes empezar a vivir tu sueño hoy mismo. Esta es tu oportunidad de asegurar un activo tangible, libre de riesgos y listo para disfrutarse. Contáctanos ahora para agendar tu visita privada y dar el primer paso hacia tu nueva vida en el Caribe.",
    "extendedDescription_en": "For many U.S. and Canadian buyers, the dream of owning a home in the Caribbean is often clouded by the logistical nightmare of building from scratch. Uncertain construction timelines, managing contractors remotely, fluctuating material quality, and language barriers can turn an exciting project into years of stress and cost overruns. The uncertainty of not knowing when (or how) your home will be finished is a risk you don't need to take.\n\nThis residence in Puntarena completely eliminates that uncertainty, offering you an immediate solution in a prime location with mangrove views. By acquiring this finished property, you gain the security of a functional home just steps from the beach and supermarkets. It is the perfect balance between the privacy of nature and the convenience of having everything within reach.\n\nFor an investment of $11,200,000 MXN, you receive a fully equipped property:\n\nResidence Features:\n- 6 Spacious bedrooms\n- 5.5 Full bathrooms\n- Private pool\n- Flex area (Yoga, Cinema, or Games)\n- 7 Air conditioning units installed\n- Hurricane impact windows\n\nGourmet \"Turnkey\" Kitchen:\n- Double-door refrigerator\n- Electric oven and stovetop with hood\n- Dishwasher\n- Granite countertops\n- Water dispenser\n- Complete set of kitchen utensils\n\nDon't waste years building when you can start living your dream today. This is your chance to secure a tangible, risk-free asset ready for enjoyment. Contact us now to schedule your private tour and take the first step toward your new life in the Caribbean.",
    "extendedDescription_fr": "Pour de nombreux acheteurs américains et canadiens, le rêve de posséder une maison dans les Caraïbes est souvent assombri par le cauchemar logistique de la construction à partir de zéro. Les délais de construction incertains, la gestion des entrepreneurs à distance, la qualité variable des matériaux et les barrières linguistiques peuvent transformer un projet passionnant en années de stress et de coûts imprévus. L'incertitude de ne pas savoir quand (ou comment) votre maison sera terminée est un risque que vous n'avez pas besoin de prendre.\n\nCette résidence à Puntarena élimine complètement cette incertitude, vous offrant une solution immédiate dans un emplacement privilégié avec vue sur la mangrove. En acquérant cette propriété finie, vous bénéficiez de la sécurité d'une maison fonctionnelle à quelques pas de la plage et des supermarchés. C'est l'équilibre parfait entre l'intimité de la nature et le confort d'avoir tout à portée de main.\n\nPour un investissement de 11 200 000 MXN, vous recevez une propriété entièrement équipée :\n\nCaractéristiques de la résidence :\n- 6 Chambres spacieuses\n- 5.5 Salles de bain complètes\n- Piscine privée\n- Espace modulable (Yoga, Cinéma ou Jeux)\n- 7 Climatiseurs installés\n- Fenêtres anticycloniques\n\nCuisine Gourmet « Clé en main » :\n- Réfrigérateur à double porte\n- Four électrique et plaques de cuisson avec hotte\n- Lave-vaisselle\n- Comptoir en granit\n- Distributeur d'eau\n- Ustensiles de cuisine complets\n\nNe perdez pas des années à construire alors que vous pouvez commencer à vivre votre rêve dès aujourd'hui. C'est votre chance de garantir un actif tangible, sans risque et prêt à être apprécié. Contactez-nous dès maintenant pour planifier votre visite privée et faire le premier pas vers votre nouvelle vie dans les Caraïbes.",
    "price": "$11,200,000 MXN",
    "image": "images/puntarena/fachada-1.webp",
    "alt": "Casa en venta Puntarena Puerto Morelos",
    "location": "Puerto Morelos",
    "type": "house",
    "bedrooms": 6,
    "bathrooms": 5.5,
    "area": 350,
    "virtualTourUrl": "virtualtours/puntarena/puntarena.html",
    "galleryPhotos": [
      "images/puntarena/fachada-1.webp",
      "images/puntarena/recibidor.webp",
      "images/puntarena/comedor.webp",
      "images/puntarena/sala.webp",
      "images/puntarena/comedor-2.webp",
      "images/puntarena/cocina.webp",
      "images/puntarena/balcon-cocina.webp",
      "images/puntarena/fachada-trasera.webp",
      "images/puntarena/bañera.webp",
      "images/puntarena/master-2.webp",
      "images/puntarena/baño-master-2.webp",
      "images/puntarena/recamara.webp",
      "images/puntarena/habitacion.webp",
      "images/puntarena/xala.webp",
      "images/puntarena/puerta-pasillo.webp",
      "images/puntarena/room.webp",
      "images/puntarena/room-2.webp",
      "images/puntarena/room-1.webp"
    ],
    
    "features": [
    "160 m² de terreno",
    "7 Aires Acondicionados inverter",
    "6 Recámaras",
    "5.5 Baños "
    ],
    "features_en": [
        "160 m² lot",
        "7 Inverter Air Conditioners",
        "6 Bedrooms",
        "5.5  Bathrooms"
    ],
    "features_fr": [
        "Terrain de 160 m²",
        "7 Climatiseurs Inverter",
        "6 Chambres",
        "5.5 Salles de bain"
    ],

    "amenities": [
        "Seguridad 24h",
        "Áreas verdes",
        "5 minutos de la playa",
        "Pickleball court",
        "Alberca"
    ],
    "amenities_en": [
        "24/7 Security",
        "Green areas",
        "5 minutes from beach",
        "Pickleball court",
        "Pool"
    ],
    "amenities_fr": [
        "Sécurité 24h/24",
        "Espaces verts",
        "À 5 minutes de la plage",
        "Terrain de Pickleball",
        "Piscine"
    ],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d2217.0013728957097!2d-86.89984016586983!3d20.850394345058245!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e0!3m2!1ses!2smx!4v1765211455498!5m2!1ses!2smx",
    "status": "Nuevo ingreso",
    "lat": 20.850316, 
    "lng": -86.897394
},
{
    "id": 12,
    "title": "Casa en Venta Palma Real Puerto Morelos",
    "description": "4 habitaciones, 3 baños,totalmente equipada",
    "extendedDescription": "Esta casa en Residencial Palma Real lo tiene todo para entrar a vivir mañana mismo. Ha sido mejorada y equipada pensando en el confort total: cuenta con una cocina integral de diseño exclusivo en madera de Tzalam (una joya tropical resistente y elegante) y viene totalmente equipada, incluyendo lavavajillas y centro de lavado. \n\nEl patio trasero es amplio y tiene el espacio perfecto para que construyas tu propia alberca privada y crees tu oasis personal. Ubicada en un entorno seguro y familiar, con parques y acceso controlado, es la opción ideal para quienes buscan calidad, acabados superiores y una ubicación estratégica en Puerto Morelos.",
    "extendedDescription_en": "This home in Residencial Palma Real has everything you need to move in tomorrow. It has been upgraded and equipped with total comfort in mind: featuring an exclusive designer kitchen made of Tzalam wood (a durable and elegant tropical hardwood) and comes fully equipped, including a dishwasher and laundry center.\n\nThe backyard is spacious and offers the perfect space to build your own private pool and create your personal oasis. Located in a safe and family-friendly environment, with parks and controlled access, it is the ideal option for those seeking quality, superior finishes, and a strategic location in Puerto Morelos.",
    "extendedDescription_fr": "Cette maison dans le Residencial Palma Real a tout pour vous accueillir dès demain. Elle a été améliorée et équipée pour un confort total : elle dispose d'une cuisine intégrale au design exclusif en bois de Tzalam (un bois tropical précieux, résistant et élégant) et est entièrement équipée, incluant lave-vaisselle et centre de lavage.\n\nL'arrière-cour est spacieuse et offre l'espace parfait pour construire votre propre piscine privée et créer votre oasis personnelle. Située dans un environnement sûr et familial, avec parcs et accès contrôlé, c'est l'option idéale pour ceux qui recherchent la qualité, des finitions supérieures et un emplacement stratégique à Puerto Morelos.",
    "price": "$4,500,000 MXN",
    "image": "images/palma-real/fachada.webp",
    "alt": "Casa en Venta Puerto Morelos Palma Real",
    "location": "Puerto Morelos",
    "type": "house",
    "bedrooms": 4,
    "bathrooms": 3,
    "area": 140,
    "virtualTourUrl": "virtualtours/palma-real/palma-real.html",
    "galleryPhotos": [
      "images/palma-real/fachada.webp",
        "images/palma-real/comedor.webp",
        "images/palma-real/cocina.webp",
        "images/palma-real/master.webp",
        "images/palma-real/baño-master.webp",
        "images/palma-real/room-2.webp",
        "images/palma-real/patio.webp",
        "images/palma-real/room.webp",
        "images/palma-real/escaleras.webp",
        "images/palma-real/cocina-1.webp",
        "images/palma-real/sala.webp",
        "images/palma-real/baño-1.webp",
        "images/palma-real/alberca.webp",
        "images/palma-real/naturaleza.webp",
        "images/palma-real/camastros.webp",
        "images/palma-real/juegos.webp"
      
    ], 
    "features": [
    "Cocina de madera de Tzalam",
    "Totalmente equipada",
    "Incluye lavavajillas y centro de lavado",
    "160 m² de terreno",
    "140 m² de construcción",
    "Patio con espacio para alberca"
    ],
    "features_en": [
        "Tzalam wood kitchen",
        "Fully equipped",
        "Dishwasher & Laundry center included",
        "160 m² lot",
        "140 m² construction",
        "Backyard with space for pool"
    ],
    "features_fr": [
        "Cuisine en bois de Tzalam",
        "Entièrement équipée",
        "Lave-vaisselle et buanderie inclus",
        "Terrain de 160 m²",
        "140 m² de construction",
        "Cour avec espace pour piscine"
    ],
    "amenities": [
        "Seguridad 24/7",
        "Parques y áreas verdes",
        "Servicios subterráneos",
        "Ubicación céntrica"
    ],
    "amenities_en": [
        "24/7 Security",
        "Parks and green areas",
        "Underground utilities",
        "Central location"
    ],
    "amenities_fr": [
        "Sécurité 24/7",
        "Parcs et espaces verts",
        "Services souterrains",
        "Emplacement central"
],
    "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d491.79620043995163!2d-86.8952694722922!3d20.86741499437957!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e1!3m2!1ses!2smx!4v1766026713705!5m2!1ses!2smx",
    "status": "Nuevo ingreso",
    "lat": 20.867167, 
    "lng": -86.895678 
}
]